exports.FACULTY_MAJOR_DATA = [
  {
    faculty: "计算机科学与技术学院",
    majors: ["计算机科学与技术", "软件工程", "网络工程", "信息安全", "人工智能"]
  },
  {
    faculty: "电子信息工程学院",
    majors: [
      "电子信息工程",
      "通信工程",
      "电子与通信工程",
      "集成电路设计与集成系统",
      "电磁场与微波技术",
      "物联网工程"
    ]
  },
  {
    faculty: "机械工程学院",
    majors: [
      "机械工程",
      "机械设计制造及其自动化",
      "机械电子工程",
      "材料成型及控制工程",
      "车辆工程",
      "测控技术与仪器"
    ]
  },
  {
    faculty: "土木与交通工程学院",
    majors: [
      "土木工程",
      "交通运输",
      "道路桥梁与渡河工程",
      "城市轨道交通",
      "给排水科学与工程"
    ]
  },
  {
    faculty: "化学化工学院",
    majors: [
      "化学工程与工艺",
      "应用化学",
      "制药工程",
      "材料科学与工程",
      "能源与环境系统工程"
    ]
  },
  {
    faculty: "生命科学与技术学院",
    majors: ["生物医学工程", "生物工程", "生物技术", "生态学", "生命科学"]
  },
  {
    faculty: "经济管理学院",
    majors: [
      "经济学",
      "国际经济与贸易",
      "会计学",
      "财务管理",
      "信息管理与信息系统",
      "工商管理",
      "市场营销"
    ]
  },
  {
    faculty: "人文与社会科学学院",
    majors: [
      "思想政治教育",
      "汉语言文学",
      "英语",
      "历史学",
      "新闻传播学",
      "社会学",
      "心理学"
    ]
  },
  {
    faculty: "法学院",
    majors: ["法学", "知识产权", "刑法", "民商法", "行政法"]
  }
]
